app/Controllers/Admin.php

    public function index()
    {
        $data['products'] = $this->productModel->findAll();
---
SELECT *
FROM `products`

    public function edit($id)
    {
        log_message('debug', 'Edit method called with ID: ' . $id);
        $product = $this->productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '6'