app/Controllers/Product.php

SELECT *
FROM `products`
---
    public function index()
    {
        $productModel = new ProductModel();
        $category = $this->request->getGet('category') ?: 'bread'; // Default ke 'bread'
        $data = [
            'activeCategory' => $category,
            'categories' => ['bread', 'danish', 'cake', 'toast', 'dcake'], // Urutan sesuai keinginan
            'products' => $productModel->findAll()