app/Controllers/Shop.php

    public function index()
    {
        $productModel = new ProductModel();
        $data = [
            'categories' => ['bread', 'danish', 'cake', 'toast', 'dcake'], // Urutan sesuai keinginan
            'products' => $productModel->findAll()
---
SELECT *
FROM `products`